'use strict';

const members = [
  '前田裕章',
  '難波祐一',
  '山本異仁',
  '橋本拓歩',
  '鈴木昌志',
  '加藤弘晃',
  '前濱拓真',
  '儀間博文',
  '森昇',
  '山本博',
  '佐原宏美',
  '金子久男',
  '林めぐみ',
  '四條萌子',
  '大平修司',
  '橋本彰',
  '高柳京平',
  '馬場美祈',
  '橋本和也',
  '難波功洋',
  '前田裕一朗',
  '松田浩樹',
  '吉松純平',
  '白井桃子',
  '伊藤慶亮',
  '内山海',
  '鈴木一世',
  '新堀将大',
  '間中勝也',
  '岡崎麻美',
  '金田和彦',
  '舘岡頼亜',
  '早川尚吾',
  '松村夏美',
  '加藤壮真',
  '古家京典',
  '勝家滉一',
  '入澤悠乃',
  '上田茉侑',
  '吉田侑平',
  '佐々木千春',
  '澤田見',
  '山木庸平',

];

const total = 6;

//チーム初期化
$('#team1').empty();
$('#team2').empty();
$('#team3').empty();
$('#team4').empty();
$('#team5').empty();
$('#team6').empty();

// 文字列を取得して改行ごとに分ける
var value = $('#members').val().split(/\n/);
var user = new Array();

// 6チームに分ける
for(var i = 0, length = value.length; i < length; i++){
  
}